Revit 2026 API

# ConnectorManagerConnectors Property

---

Return all the Connectors of the Connector Manager.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public ConnectorSet Connectors { get; }
```
```vb
Public ReadOnly Property Connectors As ConnectorSet
	Get
```
```cpp
public:
property ConnectorSet^ Connectors {
	ConnectorSet^ get ();
}
```
```fsharp
member Connectors : ConnectorSet with get
```

#### Property Value

ConnectorSet

This property is used to retrieve the Connectors from the Connector Manager.

#### Reference

ConnectorManager Class

Autodesk.Revit.DB Namespace